; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }

@xdp_stats_map = dso_local global %struct.bpf_map_def { i32 6, i32 4, i32 16, i32 5, i32 0 }, section "maps", align 4, !dbg !0
@ip_map = dso_local global %struct.bpf_map_def { i32 1, i32 1, i32 16, i32 1024, i32 0 }, section "maps", align 4, !dbg !38
@time_map = dso_local global %struct.bpf_map_def { i32 1, i32 4, i32 8, i32 1024, i32 0 }, section "maps", align 4, !dbg !48
@__const.xdp_neural_network.buf = private unnamed_addr constant [42 x i8] c"Tengo ciberataque en %02X con valores %d\0A\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !50
@llvm.compiler.used = appending global [6 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (%struct.bpf_map_def* @ip_map to i8*), i8* bitcast (%struct.bpf_map_def* @time_map to i8*), i8* bitcast (i32 (%struct.xdp_md*)* @xdp_neural_network to i8*), i8* bitcast (i32 (%struct.xdp_md*)* @xdp_parser_func to i8*), i8* bitcast (%struct.bpf_map_def* @xdp_stats_map to i8*)], section "llvm.metadata"

; Function Attrs: nounwind

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !151, line: 16, type: !40, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !37, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/irene/Desktop/xdp/libbpf/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "98c32b43891571098ce389e93bb95a7c")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/irene/Desktop/xdp/libbpf/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "db1ce4e5e29770657167bc8f57af9388")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_EmlNetActivationFunction", file: !15, line: 18, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "./neural_network_fix.h", directory: "/home/irene/Desktop/xdp/libbpf/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "418f86e14594393deccfb10a7f72237f")
!16 = !{!17, !18, !19}
!17 = !DIEnumerator(name: "EmlNetActivationIdentity", value: 0)
!18 = !DIEnumerator(name: "EmlNetActivationRelu", value: 1)
!19 = !DIEnumerator(name: "EmlNetActivationFunctions", value: 2)
!20 = !{!21, !22, !23, !26, !28, !29, !30, !35}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !24, line: 24, baseType: !25)
!24 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!25 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !31, line: 27, baseType: !32)
!31 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !33, line: 47, baseType: !34)
!33 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!34 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !31, line: 26, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !33, line: 41, baseType: !28)
!37 = !{!0, !38, !48, !50, !56, !64, !71, !76, !82, !88, !90, !114, !117, !122, !127, !129, !134, !136, !138, !141, !143}
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "ip_map", scope: !2, file: !3, line: 14, type: !40, isLocal: false, isDefinition: true)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !41, line: 33, size: 160, elements: !42)
!41 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/irene/Desktop/xdp/libbpf/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "9e37b5f46a8fb7f5ed35ab69309bf15d")
!42 = !{!43, !44, !45, !46, !47}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !41, line: 34, baseType: !7, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !40, file: !41, line: 35, baseType: !7, size: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !40, file: !41, line: 36, baseType: !7, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !40, file: !41, line: 37, baseType: !7, size: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !40, file: !41, line: 38, baseType: !7, size: 32, offset: 128)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "time_map", scope: !2, file: !3, line: 22, type: !40, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 491, type: !52, isLocal: false, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !54)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!54 = !{!55}
!55 = !DISubrange(count: 4)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !58, line: 89, type: !59, isLocal: true, isDefinition: true)
!58 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/irene/Desktop/xdp/libbpf/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "2601bcf9d7985cb46bfbd904b60f5aaf")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !24, line: 31, baseType: !63)
!63 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !58, line: 33, type: !66, isLocal: true, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!21, !21, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !58, line: 55, type: !73, isLocal: true, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!28, !21, !69, !69, !62}
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "ultByte", scope: !2, file: !3, line: 30, type: !78, isLocal: true, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 96, elements: !80)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!80 = !{!81}
!81 = !DISubrange(count: 12)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "outputs", scope: !2, file: !15, line: 13, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 96, elements: !86)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!86 = !{!87}
!87 = !DISubrange(count: 3)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "inputs", scope: !2, file: !15, line: 14, type: !84, isLocal: true, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "model", scope: !2, file: !15, line: 108, type: !92, isLocal: true, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmlNet", file: !15, line: 42, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EmlNet", file: !15, line: 34, size: 320, elements: !94)
!94 = !{!95, !96, !110, !112, !113}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "n_layers", scope: !93, file: !15, line: 36, baseType: !35, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !93, file: !15, line: 37, baseType: !97, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmlNetLayer", file: !15, line: 31, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EmlNetLayer", file: !15, line: 25, size: 256, elements: !101)
!101 = !{!102, !103, !104, !107, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "n_outputs", scope: !100, file: !15, line: 26, baseType: !35, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "n_inputs", scope: !100, file: !15, line: 27, baseType: !35, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !100, file: !15, line: 28, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "biases", scope: !100, file: !15, line: 29, baseType: !105, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "activation", scope: !100, file: !15, line: 30, baseType: !109, size: 32, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmlNetActivationFunction", file: !15, line: 22, baseType: !14)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "activations1", scope: !93, file: !15, line: 39, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "activations2", scope: !93, file: !15, line: 40, baseType: !111, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "activations_length", scope: !93, file: !15, line: 41, baseType: !35, size: 32, offset: 256)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "model_layers", scope: !2, file: !15, line: 104, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 768, elements: !86)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "model_layer0_weights", scope: !2, file: !15, line: 97, type: !119, isLocal: true, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 256, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 8)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "model_layer0_biases", scope: !2, file: !15, line: 98, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 64, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 2)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "model_layer1_weights", scope: !2, file: !15, line: 99, type: !124, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "model_layer1_biases", scope: !2, file: !15, line: 100, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 32, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "model_layer2_weights", scope: !2, file: !15, line: 101, type: !131, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "model_layer2_biases", scope: !2, file: !15, line: 102, type: !131, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "model_buf1", scope: !2, file: !15, line: 44, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !54)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "model_buf2", scope: !2, file: !15, line: 45, type: !140, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !58, line: 152, type: !145, isLocal: true, isDefinition: true)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!28, !148, !150, null}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !24, line: 27, baseType: !7)
!151 = !DIFile(filename: "./../common/xdp_stats_kern.h", directory: "/home/irene/Desktop/xdp/libbpf/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "0f65d57b07088eec24d5031993b90668")
!152 = !{i32 7, !"Dwarf Version", i32 5}
!153 = !{i32 2, !"Debug Info Version", i32 3}
!154 = !{i32 1, !"wchar_size", i32 4}
!155 = !{i32 7, !"frame-pointer", i32 2}
!156 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!157 = distinct !DISubprogram(name: "xdp_parser_func", scope: !3, file: !3, line: 33, type: !158, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !168)
!158 = !DISubroutineType(types: !159)
!159 = !{!28, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !162)
!162 = !{!163, !164, !165, !166, !167}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !161, file: !6, line: 2857, baseType: !150, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !161, file: !6, line: 2858, baseType: !150, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !161, file: !6, line: 2859, baseType: !150, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !161, file: !6, line: 2861, baseType: !150, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !161, file: !6, line: 2862, baseType: !150, size: 32, offset: 128)
!168 = !{!169, !170, !171, !172, !173, !186, !191, !192, !195, !196, !197, !198, !199, !200, !203, !204, !206, !207}
!169 = !DILocalVariable(name: "ctx", arg: 1, scope: !157, file: !3, line: 33, type: !160)
!170 = !DILocalVariable(name: "start_time_parser", scope: !157, file: !3, line: 37, type: !34)
!171 = !DILocalVariable(name: "data_end", scope: !157, file: !3, line: 40, type: !21)
!172 = !DILocalVariable(name: "data", scope: !157, file: !3, line: 41, type: !21)
!173 = !DILocalVariable(name: "eth", scope: !157, file: !3, line: 42, type: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !176, line: 168, size: 112, elements: !177)
!176 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!177 = !{!178, !182, !183}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !175, file: !176, line: 169, baseType: !179, size: 48)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 48, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 6)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !175, file: !176, line: 170, baseType: !179, size: 48, offset: 48)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !175, file: !176, line: 171, baseType: !184, size: 16, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !185, line: 25, baseType: !23)
!185 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!186 = !DILocalVariable(name: "nh", scope: !157, file: !3, line: 43, type: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !188, line: 33, size: 64, elements: !189)
!188 = !DIFile(filename: "./parsing_helpers.h", directory: "/home/irene/Desktop/xdp/libbpf/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "347e5950d9164c54cb6bf50ac022e20c")
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !187, file: !188, line: 34, baseType: !21, size: 64)
!191 = !DILocalVariable(name: "eth_type", scope: !157, file: !3, line: 44, type: !28)
!192 = !DILocalVariable(name: "size", scope: !193, file: !3, line: 58, type: !28)
!193 = distinct !DILexicalBlock(scope: !194, file: !3, line: 54, column: 38)
!194 = distinct !DILexicalBlock(scope: !157, file: !3, line: 54, column: 6)
!195 = !DILocalVariable(name: "ipv6", scope: !193, file: !3, line: 60, type: !26)
!196 = !DILocalVariable(name: "type", scope: !193, file: !3, line: 61, type: !26)
!197 = !DILocalVariable(name: "lastbyte", scope: !193, file: !3, line: 62, type: !26)
!198 = !DILocalVariable(name: "code", scope: !193, file: !3, line: 196, type: !28)
!199 = !DILocalVariable(name: "count", scope: !193, file: !3, line: 198, type: !29)
!200 = !DILocalVariable(name: "initial_count", scope: !201, file: !3, line: 202, type: !29)
!201 = distinct !DILexicalBlock(scope: !202, file: !3, line: 201, column: 21)
!202 = distinct !DILexicalBlock(scope: !193, file: !3, line: 201, column: 7)
!203 = !DILocalVariable(name: "time_parsing", scope: !193, file: !3, line: 216, type: !28)
!204 = !DILocalVariable(name: "total_parsing", scope: !193, file: !3, line: 217, type: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!206 = !DILocalVariable(name: "end_time_parser", scope: !193, file: !3, line: 218, type: !34)
!207 = !DILocalVariable(name: "duration_parsing", scope: !193, file: !3, line: 219, type: !34)
!208 = !DILocation(line: 0, scope: !157)
!209 = !DILocation(line: 37, column: 36, scope: !157)
!210 = !DILocation(line: 40, column: 38, scope: !157)
!211 = !{!212, !213, i64 4}
!212 = !{!"xdp_md", !213, i64 0, !213, i64 4, !213, i64 8, !213, i64 12, !213, i64 16}
!213 = !{!"int", !214, i64 0}
!214 = !{!"omnipotent char", !215, i64 0}
!215 = !{!"Simple C/C++ TBAA"}
!216 = !DILocation(line: 40, column: 27, scope: !157)
!217 = !DILocation(line: 40, column: 19, scope: !157)
!218 = !DILocation(line: 41, column: 34, scope: !157)
!219 = !{!212, !213, i64 0}
!220 = !DILocation(line: 41, column: 23, scope: !157)
!221 = !DILocation(line: 41, column: 15, scope: !157)
!222 = !DILocalVariable(name: "nh", arg: 1, scope: !223, file: !188, line: 124, type: !226)
!223 = distinct !DISubprogram(name: "parse_ethhdr", scope: !188, file: !188, line: 124, type: !224, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !228)
!224 = !DISubroutineType(types: !225)
!225 = !{!28, !226, !21, !227}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!228 = !{!222, !229, !230}
!229 = !DILocalVariable(name: "data_end", arg: 2, scope: !223, file: !188, line: 125, type: !21)
!230 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !223, file: !188, line: 126, type: !227)
!231 = !DILocation(line: 0, scope: !223, inlinedAt: !232)
!232 = distinct !DILocation(line: 49, column: 13, scope: !157)
!233 = !DILocalVariable(name: "nh", arg: 1, scope: !234, file: !188, line: 79, type: !226)
!234 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !188, file: !188, line: 79, type: !235, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !242)
!235 = !DISubroutineType(types: !236)
!236 = !{!28, !226, !21, !227, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !188, line: 64, size: 32, elements: !239)
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !238, file: !188, line: 65, baseType: !241, size: 32)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !125)
!242 = !{!233, !243, !244, !245, !246, !247, !248, !254, !255}
!243 = !DILocalVariable(name: "data_end", arg: 2, scope: !234, file: !188, line: 80, type: !21)
!244 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !234, file: !188, line: 81, type: !227)
!245 = !DILocalVariable(name: "vlans", arg: 4, scope: !234, file: !188, line: 82, type: !237)
!246 = !DILocalVariable(name: "eth", scope: !234, file: !188, line: 84, type: !174)
!247 = !DILocalVariable(name: "hdrsize", scope: !234, file: !188, line: 85, type: !28)
!248 = !DILocalVariable(name: "vlh", scope: !234, file: !188, line: 86, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !188, line: 42, size: 32, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !250, file: !188, line: 43, baseType: !184, size: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !250, file: !188, line: 44, baseType: !184, size: 16, offset: 16)
!254 = !DILocalVariable(name: "h_proto", scope: !234, file: !188, line: 87, type: !23)
!255 = !DILocalVariable(name: "i", scope: !234, file: !188, line: 88, type: !28)
!256 = !DILocation(line: 0, scope: !234, inlinedAt: !257)
!257 = distinct !DILocation(line: 129, column: 9, scope: !223, inlinedAt: !232)
!258 = !DILocation(line: 93, column: 14, scope: !259, inlinedAt: !257)
!259 = distinct !DILexicalBlock(scope: !234, file: !188, line: 93, column: 6)
!260 = !DILocation(line: 93, column: 24, scope: !259, inlinedAt: !257)
!261 = !DILocation(line: 93, column: 6, scope: !234, inlinedAt: !257)
!262 = !DILocation(line: 99, column: 17, scope: !234, inlinedAt: !257)
!263 = !{!264, !264, i64 0}
!264 = !{!"short", !214, i64 0}
!265 = !DILocalVariable(name: "h_proto", arg: 1, scope: !266, file: !188, line: 68, type: !23)
!266 = distinct !DISubprogram(name: "proto_is_vlan", scope: !188, file: !188, line: 68, type: !267, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !269)
!267 = !DISubroutineType(types: !268)
!268 = !{!28, !23}
!269 = !{!265}
!270 = !DILocation(line: 0, scope: !266, inlinedAt: !271)
!271 = distinct !DILocation(line: 106, column: 8, scope: !272, inlinedAt: !257)
!272 = distinct !DILexicalBlock(scope: !273, file: !188, line: 106, column: 7)
!273 = distinct !DILexicalBlock(scope: !274, file: !188, line: 105, column: 39)
!274 = distinct !DILexicalBlock(scope: !275, file: !188, line: 105, column: 2)
!275 = distinct !DILexicalBlock(scope: !234, file: !188, line: 105, column: 2)
!276 = !DILocation(line: 70, column: 20, scope: !266, inlinedAt: !271)
!277 = !DILocation(line: 70, column: 46, scope: !266, inlinedAt: !271)
!278 = !DILocation(line: 106, column: 8, scope: !272, inlinedAt: !257)
!279 = !DILocation(line: 106, column: 7, scope: !273, inlinedAt: !257)
!280 = !DILocation(line: 112, column: 18, scope: !273, inlinedAt: !257)
!281 = !DILocation(line: 54, column: 15, scope: !194)
!282 = !DILocation(line: 54, column: 6, scope: !157)
!283 = !DILocation(line: 58, column: 24, scope: !193)
!284 = !DILocation(line: 0, scope: !193)
!285 = !DILocation(line: 66, column: 7, scope: !193)
!286 = !DILocation(line: 70, column: 15, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !3, line: 70, column: 8)
!288 = distinct !DILexicalBlock(scope: !289, file: !3, line: 66, column: 18)
!289 = distinct !DILexicalBlock(scope: !193, file: !3, line: 66, column: 7)
!290 = !DILocation(line: 70, column: 19, scope: !287)
!291 = !DILocation(line: 70, column: 8, scope: !288)
!292 = !DILocation(line: 76, column: 13, scope: !293)
!293 = distinct !DILexicalBlock(scope: !288, file: !3, line: 76, column: 8)
!294 = !DILocation(line: 76, column: 18, scope: !293)
!295 = !DILocation(line: 76, column: 8, scope: !288)
!296 = !DILocation(line: 83, column: 15, scope: !297)
!297 = distinct !DILexicalBlock(scope: !288, file: !3, line: 83, column: 8)
!298 = !DILocation(line: 83, column: 19, scope: !297)
!299 = !DILocation(line: 83, column: 8, scope: !288)
!300 = !DILocation(line: 96, column: 15, scope: !301)
!301 = distinct !DILexicalBlock(scope: !302, file: !3, line: 96, column: 8)
!302 = distinct !DILexicalBlock(scope: !303, file: !3, line: 93, column: 23)
!303 = distinct !DILexicalBlock(scope: !289, file: !3, line: 93, column: 12)
!304 = !DILocation(line: 96, column: 18, scope: !301)
!305 = !DILocation(line: 96, column: 8, scope: !302)
!306 = !DILocation(line: 105, column: 15, scope: !307)
!307 = distinct !DILexicalBlock(scope: !302, file: !3, line: 105, column: 8)
!308 = !DILocation(line: 105, column: 19, scope: !307)
!309 = !DILocation(line: 105, column: 8, scope: !302)
!310 = !DILocation(line: 115, column: 15, scope: !311)
!311 = distinct !DILexicalBlock(scope: !302, file: !3, line: 115, column: 8)
